In [1]:
import numpy as np
import pandas as pd

data2_url = "https://raw.githubusercontent.com/AliceLiu17/csc448_final/main/data/data2/spam.csv"
data3_url = "https://raw.githubusercontent.com/AliceLiu17/csc448_final/main/data/data3/spam_or_not_spam.csv"

df_2 = pd.read_csv(data2_url)
df_3 = pd.read_csv(data3_url)

In [2]:
df_2.head()

  Category                                            Message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...

In [3]:
df_3.head()

                                               email  label
0   date wed NUMBER aug NUMBER NUMBER NUMBER NUMB...      0
1  martin a posted tassos papadopoulos the greek ...      0
2  man threatens explosion in moscow thursday aug...      0
3  klez the virus that won t die already the most...      0
4   in adding cream to spaghetti carbonara which ...      0

### NOTES:
df_3 : 

label = 0 = non-spam

label = 1 = spam

In [4]:
df_2.columns

Index(['Category', 'Message'], dtype='object')

In [5]:
df_3.columns

Index(['email', 'label'], dtype='object')

In [6]:
df_2.shape

(5572, 2)

In [7]:
df_3.shape

(3000, 2)

In [8]:
## change df_2 column name and values to 0 and 1 to match df_3
df_2["Category"].unique()

array(['ham', 'spam'], dtype=object)

In [9]:
## change df_2 column name and values of category to 0 and 1 to match df_3
df_2["Category"] = df_2["Category"].replace('ham', '0')
df_2["Category"] = df_2["Category"].replace('spam', '1')

In [10]:
df_2.rename(columns = {"Category" : "label"}, inplace = True)
df_2.rename(columns = {"Message" : "email"}, inplace = True)

In [11]:
df_3 = df_3[['label', 'email']] # switch around label and email to align the columns

In [12]:
df_2.head()

  label                                              email
0     0  Go until jurong point, crazy.. Available only ...
1     0                      Ok lar... Joking wif u oni...
2     1  Free entry in 2 a wkly comp to win FA Cup fina...
3     0  U dun say so early hor... U c already then say...
4     0  Nah I don't think he goes to usf, he lives aro...

In [13]:
df_3.head()

   label                                              email
0      0   date wed NUMBER aug NUMBER NUMBER NUMBER NUMB...
1      0  martin a posted tassos papadopoulos the greek ...
2      0  man threatens explosion in moscow thursday aug...
3      0  klez the virus that won t die already the most...
4      0   in adding cream to spaghetti carbonara which ...

In [14]:
# combine vertically
df_combined = pd.concat([df_2, df_3], ignore_index=True)

In [15]:
df_combined.head()

  label                                              email
0     0  Go until jurong point, crazy.. Available only ...
1     0                      Ok lar... Joking wif u oni...
2     1  Free entry in 2 a wkly comp to win FA Cup fina...
3     0  U dun say so early hor... U c already then say...
4     0  Nah I don't think he goes to usf, he lives aro...

In [16]:
df_combined.shape

# (5572, 2) = df_2
# (3000, 2) = df_3
# combined = (8572, 2)

(8572, 2)

In [17]:
# drop duplicates
df_combined = df_combined.drop_duplicates()

In [18]:
df_combined.shape

(8030, 2)

In [19]:
count = 0

unique_emails = df_combined["email"].unique()

for i in unique_emails:
    count = count + 1
    
print(count)

# unique emails is the same as shape, so no duplicate emails with the same spam

8030

In [21]:
df_combined.isnull().sum()

label    0
email    1
dtype: int64

In [ ]:
## drop NULL value

In [20]:
df_combined.to_csv("combined_data.csv", index = False)